{"posts":[{"title":"Hello World","text":"Welcome to Hexo! This is your very first post. Check documentation for more info. If you get any problems when using Hexo, you can find the answer in troubleshooting or you can ask me on GitHub. Quick StartCreate a new post1$ hexo new &quot;My New Post&quot; More info: Writing Run server1$ hexo server More info: Server Generate static files1$ hexo generate More info: Generating Deploy to remote sites1$ hexo deploy More info: Deployment","link":"/2024/12/26/hello-world/"}],"tags":[],"categories":[],"pages":[{"title":"Home","text":"Who am IHi, I’m PENG Sai, but I go by my English name, Emily, which I chose back in middle school. I’m a Ph.D. researcher at KU Leuven in Belgium, exploring topics like embedded systems, wearable devices, smart sensors, and soft robotics. My passion is creating innovations that contribute to healthcare and rehabilitation. Before starting my Ph.D., I worked in the industry at Microsoft and Micron. Back then, I felt like a directionless boat, drifting from one milestone to another: earning money, getting married, buying a house, getting promoted. However, the COVID-19 lockdown gave me time to reflect deeply on life. During that time, I decided to pursue a Ph.D. After accompanying a loved one with cancer to the hospital, I witnessed many heartbreaking stories that further fueled my desire to make a meaningful impact. Why this siteI’ve been blogging since 2016, starting with a Chinese public account, then moving to CSDN, and later to GitHub. Writing has always been something I enjoy, for myself, and hopefully, to connect with like-minded people. The main purposes of this site are: Showcasing my independent research Recording my personal achievements Listing the problems I aim to solve Discussing wearable and smart devices and their practical applications I still have no answer for what is the meaning of life. But I’m already on the way.","link":"/index.html"},{"title":"about","text":"","link":"/about/index.html"},{"title":"Publications","text":"Journals 9. Recent Advances in 3-D Printed, Wearable Pressure Sensors for Plantar Pressure Monitoring: A ReviewAuthors: Sai Peng; Hytham Hassan; Stijn Rosseel; Giovanni A. Matricali; Kevin Deschamps; Veerle Vandeginste; Hans Hallez.Journal: IEEE Sensors Journal, 2024 8. Scalable processing ultrathin polymer dielectric films with a generic solution based approach for wearable soft electronicsAuthors: Sujie Chen, Sai Peng, Wenjian Sun, Guoying Gu, Qing Zhang, Xiaojun GuoJournal: Advanced Materials Technologies, 2019 7. Integrated Soft Ionotronic Skin with Stretchable and Transparent Hydrogel-Elastomer Ionic Sensors for Hand-Motion MonitoringAuthors: Guoying Gu; Haipeng Xu; Sai Peng; Ling Li; Sujie Chen; Tongqing Lu; Xiaojun Guo.Journal: SOFT ROBOTICS, 2019 6. High Sensitivity Capacitive Pressure Sensor With Bi-Layer Porous Structure Elastomeric Dielectric Formed by a Facile Solution Based ProcessAuthors: Sai Peng; Sujie Chen; Yukun Huang; Shuai Pei; Xiaojun Guo.Journal: IEEE SENSORS LETTERS, 2019 5. Integrated Low Voltage Ion Sensing Organic Field Effect Transistor System on PlasticAuthors: Qiaofeng Li; Jiaqing Zhao; Yukun Huang; Wei Tang; Sai Peng; Shi Qiu; Qiuqi Zhang; Xiaojun Guo.Journal: IEEE ELECTRON DEVICE LETTERS, 2018 4. Silver Nanowire Mesh-Based Fuse Type Write-Once-Read-Many MemoryAuthors: Luyao Zhu; Sujie Chen; Haoyu Zhou; Sai Peng; Qiuqi Zhang; Xiachang Zhang; Xiaojun Guo.Journal: IEEE ELECTRON DEVICE LETTERS, 2018 3. Improved Sensitivity of Inkjet-Printed PEDOT:PSS Ammonia Sensor With “Nonideal” MorphologyAuthors: Siying Li; Yuanzhe Li; Sujie Chen; Wei Tang; Yukun Huang; Sai Peng; Jianrong Qi; Xiaojun Guo.Journal: IEEE SENSORS LETTERS, 2018 2. Silver nanowire/polymer composite soft conductive film fabricated by large-area compatible coating for flexible pressure sensor arrayAuthors: Sujie Chen, Siying Li, Sai Peng, Yukun Huang, Jiaqing Zhao, Wei Tang and Xiaojun GuoJournal: JOURNAL OF SEMICONDUCTORS, 2018 1. Stable Thin-Film Reference Electrode on Plastic Substrate for All-Solid-State Ion-Sensitive Field-Effect Transistor Sensing SystemAuthors: Qiaofeng Li; Wei Tang; Yuezeng Su; Yukun Huang; Sai Peng; Bengang Zhuo; Shi Qiu; Li Ding; Yuanzhe Li; Xiaojun Guo.Journal: IEEE ELECTRON DEVICE LETTERS, 2017 Conferences 1. Wireless Readout System for Pressure Monitoring Using FFF-Printed Mold Fabricated Flexible Piezoresistive SensorsAuthors: Sai Peng; Arthur Camelbeke; Kevin Deschamps; Veerle Vandeginste; Hans HallezConference: 2024 IEEE SENSORS, 2024","link":"/publications/index.html"}]}