{"posts":[{"title":"Breathe and Allow Things to Pass","text":"You will continue to suffer if you have an emotional reaction to everything that is said to you. True power is sitting back and observing things with logic. True power is restraint. If words control you that means everyone else can control you. Breathe and allow things to pass.","link":"/2024/12/29/Breathe-and-Allow-Things-to-Pass/"},{"title":"Regulating Emotions: Invasive or Non-invasive?","text":"","link":"/2024/12/28/Regulating-Emotions-Invasive-or-Non-invasive/"}],"tags":[{"name":"morning_flowers","slug":"morning-flowers","link":"/tags/morning-flowers/"},{"name":"wearble devices","slug":"wearble-devices","link":"/tags/wearble-devices/"},{"name":"questions","slug":"questions","link":"/tags/questions/"},{"name":"depression","slug":"depression","link":"/tags/depression/"}],"categories":[{"name":"fillingstation","slug":"fillingstation","link":"/categories/fillingstation/"},{"name":"articles","slug":"articles","link":"/categories/articles/"}],"pages":[{"title":"Introduction","text":"Who am IHi, I’m PENG Sai (彭赛), and I also go by my English name, Emily, which I chose back in middle school. I’m a Ph.D. researcher at KU Leuven in Belgium, exploring topics like embedded systems, wearable devices, smart sensors, and soft robotics. My ultimate goal is to develop technologies that make a real difference in healthcare and rehabilitation. Before embarking on my Ph.D. journey, I worked at Microsoft and Micron. Back then, I felt like a ship adrift, chasing milestones like earning money, getting married, buying a house, and climbing the career ladder, but without a true sense of purpose. The COVID-19 lockdown gave me the time to work from home and reflect on life’s bigger questions. It was during this period that I decided to pursue a Ph.D. Witnessing the struggles of a loved one battling cancer and the many heartbreaking stories I encountered at the hospital further solidified my resolve to contribute meaningfully to the world. Why this siteI’ve been blogging since 2016, starting on a Chinese public account, then transitioning to CSDN, and eventually to GitHub. Writing has always been a personal joy for me, a way to document my thoughts and, with luck, connect with others who share similar interests. This site serves a few key purposes: Showcasing my independent research and its outcomes Documenting my personal achievements Highlighting the challenges I aim to tackle Exploring and discussing wearable and smart devices, along with their real-world applications I may not have the answer to life’s ultimate question, but I know I’m on a journey that brings me fulfillment. That’s a good start.","link":"/index.html"},{"title":"Publications","text":"Journals 9. Recent Advances in 3-D Printed, Wearable Pressure Sensors for Plantar Pressure Monitoring: A ReviewAuthors: Sai Peng; Hytham Hassan; Stijn Rosseel; Giovanni A. Matricali; Kevin Deschamps; Veerle Vandeginste; Hans Hallez.Journal: IEEE Sensors Journal, 2024 8. Scalable processing ultrathin polymer dielectric films with a generic solution based approach for wearable soft electronicsAuthors: Sujie Chen; Sai Peng; Wenjian Sun; Guoying Gu; Qing Zhang; Xiaojun Guo.Journal: Advanced Materials Technologies, 2019 7. Integrated Soft Ionotronic Skin with Stretchable and Transparent Hydrogel-Elastomer Ionic Sensors for Hand-Motion MonitoringAuthors: Guoying Gu; Haipeng Xu; Sai Peng; Ling Li; Sujie Chen; Tongqing Lu; Xiaojun Guo.Journal: SOFT ROBOTICS, 2019 6. High Sensitivity Capacitive Pressure Sensor With Bi-Layer Porous Structure Elastomeric Dielectric Formed by a Facile Solution Based ProcessAuthors: Sai Peng; Sujie Chen; Yukun Huang; Shuai Pei; Xiaojun Guo.Journal: IEEE SENSORS LETTERS, 2019 5. Integrated Low Voltage Ion Sensing Organic Field Effect Transistor System on PlasticAuthors: Qiaofeng Li; Jiaqing Zhao; Yukun Huang; Wei Tang; Sai Peng; Shi Qiu; Qiuqi Zhang; Xiaojun Guo.Journal: IEEE ELECTRON DEVICE LETTERS, 2018 4. Silver Nanowire Mesh-Based Fuse Type Write-Once-Read-Many MemoryAuthors: Luyao Zhu; Sujie Chen; Haoyu Zhou; Sai Peng; Qiuqi Zhang; Xiachang Zhang; Xiaojun Guo.Journal: IEEE ELECTRON DEVICE LETTERS, 2018 3. Improved Sensitivity of Inkjet-Printed PEDOT:PSS Ammonia Sensor With “Nonideal” MorphologyAuthors: Siying Li; Yuanzhe Li; Sujie Chen; Wei Tang; Yukun Huang; Sai Peng; Jianrong Qi; Xiaojun Guo.Journal: IEEE SENSORS LETTERS, 2018 2. Silver nanowire/polymer composite soft conductive film fabricated by large-area compatible coating for flexible pressure sensor arrayAuthors: Sujie Chen, Siying Li, Sai Peng, Yukun Huang, Jiaqing Zhao, Wei Tang and Xiaojun GuoJournal: JOURNAL OF SEMICONDUCTORS, 2018 1. Stable Thin-Film Reference Electrode on Plastic Substrate for All-Solid-State Ion-Sensitive Field-Effect Transistor Sensing SystemAuthors: Qiaofeng Li; Wei Tang; Yuezeng Su; Yukun Huang; Sai Peng; Bengang Zhuo; Shi Qiu; Li Ding; Yuanzhe Li; Xiaojun Guo.Journal: IEEE ELECTRON DEVICE LETTERS, 2017 Conferences 1. Wireless Readout System for Pressure Monitoring Using FFF-Printed Mold Fabricated Flexible Piezoresistive SensorsAuthors: Sai Peng; Arthur Camelbeke; Kevin Deschamps; Veerle Vandeginste; Hans HallezConference: 2024 IEEE SENSORS, 2024","link":"/publications/index.html"}]}