{"posts":[{"title":"Breathe and Allow Things to Pass","text":"You will continue to suffer if you have an emotional reaction to everything that is said to you. True power is sitting back and observing things with logic. True power is restraint. If words control you that means everyone else can control you. Breathe and allow things to pass.","link":"/2024/12/29/Breathe-and-Allow-Things-to-Pass/"},{"title":"ML-Ch1-The Machine Learning Landscape","text":"IntroductionIn this blog series, I will be documenting my learning journey with the book [Hands-On Machine Learning with Scikit-Learn, Keras, and TensorFlow] (link: https://www.oreilly.com/library/view/hands-on-machine-learning/9781492032632/) by Aurélien Géron. This book is an excellent resource for gaining practical skills in machine learning and deep learning using Python libraries like Scikit-Learn, Keras, and TensorFlow. My goal is to learn and implement the algorithms discussed in the book and apply them to real-world problems. Each blog post will focus on a specific chapter or concept from the book, with practical code examples and insights. Takehome notesMachine learning is great for: problems for which existing solutions require a lot of fine-tuning or long lists of rules complex problems for which using a traditional approach yields no good solution fluctuating environments getting insights about complex problems and large amounts of data Types of machine learning systemsTraining Supervision Classify principle: How they are supervised during training. supervised learning Classify principle: the training set you feed to the algorithm includes the desired solutions, called labels. example: A labeled training set for spam classification; To predict a target numeric value, a regression problem. unsupervised learning Classify principle: the training data is unlabeled, the system tries to learn without a teacher. example: To run a clustering algorithm to try to detect groups of similar visitors of your blog; To feed visualization algorithms a lot of complex and unlabeled data, and they output a 2D or 3D representation of your data that can easily be plotted. Anomaly detection. Association rule learning: in which the goal is to dig into large amounts of data and discover interesting relations between attributes. semi-supervised learning Classify principle: Since labeling data is usually time-consuming and costly, you will often have plenty of unlabeled instances, and few labeled instances. example: some photo-hosting services. most semi-supervised learning algorithms are combinations of unsupervised and supervised algorighms. self-supervised learning Classify principle: generating a fully labeled dataset from a fully unlabeled one. Once the whole dataset is labeled, any supervised learning algorighm can be used. example: to repair damaged images or to erase unwanted objects from pictures. reinforcement learning Classify principle: The learning system, called an agent, can observe the environment, select and perform actions, and get rewards in return (rewards or penalties). example: many robots implement reinforcement learning algorithms to learn how to walk; DeepMind’s AlphaGo! Batch versus Online Learning Classify principle: whether or not the system can learn incrementally from a stream of incoming data. batch learning Classify principle: the system is incapable of learning incrementally: it must be trained using all the available data. also called offline learning: first the system is trained, and then it is launched into production and runs without learning anymore; it just applies what is has learned. pros: this solution is simple and often works fine cons: time-consuming and requires a lot of computing resources (CPU, memory space, disk space, disk I/O, network I/O, etc). online learning Classify principle: the system is fed by data instances sequentially, either individually or in small groups called mini-batches. Each learning step is fast and cheap, so the system can learn about new data on the fly, as it arrives. pros: useful for systems that need to adapt to change extremely rapidly; good for systems with limited computing resources ike training on a mobile device. cons: if bad data is fed to the system, the system’s performance will decline, possibly quickly.","link":"/2025/01/01/ML-Ch1-The-Machine-Learning-Landscape/"},{"title":"Regulating Emotions: Invasive or Non-invasive?","text":"This month, I attended the 21st International Conference on Embedded Wireless Systems and Networks (EWSN’24) in Abu Dhabi. It was quite an eventful experience for several reasons: 1. A Challenging Business TripThis was my first time traveling for work with a colleague, and it made me realize how much I still need to improve when working alongside others. The trip wasn’t without its challenges, my colleague had a high fever during the conference, and I experienced acclimatization issues from the second day, which left me vomiting the entire night. After returning to Belgium, I came down with a high fever for two days, during which I was bedridden and barely conscious. Ending the year in such a way was definitely a unique experience, though not one I’d want to repeat! 2. Exploring Abu DhabiDespite the challenges, I managed to enjoy some of Abu Dhabi’s highlights. I saw a stunning desert sunset, went on a desert safari, rode a camel, and visited the breathtaking Sheikh Zayed Mosque. However, I realized I’m a bit of a sentimental traveler. I always feel something is missing when I can’t share these experiences with my husband or close friends. That said, Abu Dhabi is a fantastic place to visit, and I found myself wishing several times that my husband could have been there to experience it with me. 3. Thoughts on the Conference As a relatively new researcher, every conference I attend leaves me with a strong urge to return to my lab and dive into experiments. At times, I find the social aspects of these events overwhelming or even somewhat meaningless because I feel I’m not yet strong enough to collaborate effectively with others. A voice in my head constantly tells me, “Work harder, Emily!”. AI and machine learning dominated much of the research presented at the conference, which initially felt discouraging since these aren’t my areas of expertise. However, I’ve resolved not to fall behind. If AI is a valuable tool, I need to familiarize myself with it and find ways to integrate it into my work. As a first step, I’ve added “learning machine learning” to my 2025 to-do list, and I’m determined to make progress in this field. One of the keynotes I was most excited about was “Sensory Interventions: Real-time integration of passive sensing and adaptive passive interventions” by Prof. Tanzeem Choudhury from Cornell Tech. While I had high expectations for this presentation, I must admit I left feeling a bit disappointed. The speaker only briefly touched upon the subject and didn’t delve into the detailed or advanced technologies I was hoping to learn more about. However, I understand that this is often the nature of a conference keynote During the Q&amp;A session, I asked whether heart rate was the only parameter they used to assess emotion and whether they had considered any invasive sensing methods. The answer was “yes” and “no.” I couldn’t help but think about how deep brain stimulation (DBS) surgery has already been verified as a promising approach to treating depression [1]. To me, it seems like DBS represents the gold standard for addressing emotional disorders. By comparison, their team’s non-invasive approach, relying solely on heart rate, initially felt overly simplistic and limited. However, after reflecting on it, I realized their method has its merits. For cases that are not treatment-resistant depression, why not explore simpler, non-invasive ways to address the problem? If it works, it could be an accessible and practical solution for many people. Interestingly, this aligns with what I aim to achieve for diabetic patients—finding effective, non-invasive methods to improve their quality of life. Reference [1] Scangos, K.W., Khambhati, A.N., Daly, P.M. et al. Closed-loop neuromodulation in an individual with treatment-resistant depression. Nat Med 27, 1696–1700 (2021). https://doi-org.kuleuven.e-bronnen.be/10.1038/s41591-021-01480-w.","link":"/2024/12/28/Regulating-Emotions-Invasive-or-Non-invasive/"}],"tags":[{"name":"morning_flowers","slug":"morning-flowers","link":"/tags/morning-flowers/"},{"name":"Machine Learning","slug":"Machine-Learning","link":"/tags/Machine-Learning/"},{"name":"Hands-On Machine Learning","slug":"Hands-On-Machine-Learning","link":"/tags/Hands-On-Machine-Learning/"},{"name":"questions","slug":"questions","link":"/tags/questions/"},{"name":"depression","slug":"depression","link":"/tags/depression/"},{"name":"conferences","slug":"conferences","link":"/tags/conferences/"},{"name":"wearable devices","slug":"wearable-devices","link":"/tags/wearable-devices/"}],"categories":[{"name":"fillingstation","slug":"fillingstation","link":"/categories/fillingstation/"},{"name":"keeplearning","slug":"keeplearning","link":"/categories/keeplearning/"},{"name":"articles","slug":"articles","link":"/categories/articles/"}],"pages":[{"title":"Introduction","text":"Who am IHi, I’m PENG Sai (彭赛), and I also go by my English name, Emily, which I chose back in middle school. I’m a Ph.D. researcher at KU Leuven in Belgium, exploring topics like embedded systems, wearable devices, smart sensors, and soft robotics. My ultimate goal is to develop technologies that make a real difference in healthcare and rehabilitation. Before embarking on my Ph.D. journey, I worked at Microsoft and Micron. Back then, I felt like a ship adrift, chasing milestones like earning money, getting married, buying a house, and climbing the career ladder, but without a true sense of purpose. The COVID-19 lockdown gave me the time to work from home and reflect on life’s bigger questions. It was during this period that I decided to pursue a Ph.D. Witnessing the struggles of a loved one battling cancer and the many heartbreaking stories I encountered at the hospital further solidified my resolve to contribute meaningfully to the world. Why this siteI’ve been blogging since 2012, starting on CSDN, then transitioning to a Chinese public account, and eventually to GitHub. Writing has always been a personal joy for me, a way to document my thoughts and, with luck, connect with others who share similar interests. This site serves a few key purposes: Showcasing my independent research and its outcomes Documenting my personal achievements Highlighting the challenges I aim to tackle Exploring and discussing wearable and smart devices, along with their real-world applications I may not have the answer to life’s ultimate question, but I know I’m on a journey that brings me fulfillment. That’s a good start.","link":"/index.html"},{"title":"","text":"/* 调整页面主要内容和侧边栏的宽度 */ .page-main { width: calc(100% - 200px); /* 主内容区域宽度，350px 是侧边栏宽度 */ max-width: none; /* 取消最大宽度限制 */ margin: 0 auto; } .post-title { font-size: 2.5em; font-weight: bold; text-align: center; color: #333; /* 标题颜色 */ text-shadow: 2px 2px 5px rgba(0, 0, 0, 0.1); /* 添加阴影 */ border-bottom: 2px solid #ddd; /* 底部划线 */ padding-bottom: 10px; /* 调整下边距 */ margin-bottom: 20px; /* 与正文保持间距 */ } .sidebar { width: 200px; /* 侧边栏宽度 */ } /* 调整整体布局 */ .content-wrapper { max-width: 1400px; /* 整体页面宽度 */ margin: 0 auto; /* 居中对齐 */ } /* 响应式调整：在较小屏幕时恢复默认布局 */ @media (max-width: 768px) { .page-main { width: 100%; /* 主内容占满屏幕 */ padding: 0 15px; /* 增加左右留白 */ } .sidebar { width: 100%; /* 侧边栏宽度随屏幕变化 */ margin-bottom: 20px; /* 增加侧边栏下方留白 */ } .post-title, h1 { font-size: 2em; /* 缩小字体大小以适应小屏幕 */ } }","link":"/css/custom.css"},{"title":"Publications","text":"Journals 9. Recent Advances in 3-D Printed, Wearable Pressure Sensors for Plantar Pressure Monitoring: A ReviewAuthors: Sai Peng; Hytham Hassan; Stijn Rosseel; Giovanni A. Matricali; Kevin Deschamps; Veerle Vandeginste; Hans Hallez.Journal: IEEE Sensors Journal, 2024 8. Scalable processing ultrathin polymer dielectric films with a generic solution based approach for wearable soft electronicsAuthors: Sujie Chen; Sai Peng; Wenjian Sun; Guoying Gu; Qing Zhang; Xiaojun Guo.Journal: Advanced Materials Technologies, 2019 7. Integrated Soft Ionotronic Skin with Stretchable and Transparent Hydrogel-Elastomer Ionic Sensors for Hand-Motion MonitoringAuthors: Guoying Gu; Haipeng Xu; Sai Peng; Ling Li; Sujie Chen; Tongqing Lu; Xiaojun Guo.Journal: SOFT ROBOTICS, 2019 6. High Sensitivity Capacitive Pressure Sensor With Bi-Layer Porous Structure Elastomeric Dielectric Formed by a Facile Solution Based ProcessAuthors: Sai Peng; Sujie Chen; Yukun Huang; Shuai Pei; Xiaojun Guo.Journal: IEEE SENSORS LETTERS, 2019 5. Integrated Low Voltage Ion Sensing Organic Field Effect Transistor System on PlasticAuthors: Qiaofeng Li; Jiaqing Zhao; Yukun Huang; Wei Tang; Sai Peng; Shi Qiu; Qiuqi Zhang; Xiaojun Guo.Journal: IEEE ELECTRON DEVICE LETTERS, 2018 4. Silver Nanowire Mesh-Based Fuse Type Write-Once-Read-Many MemoryAuthors: Luyao Zhu; Sujie Chen; Haoyu Zhou; Sai Peng; Qiuqi Zhang; Xiachang Zhang; Xiaojun Guo.Journal: IEEE ELECTRON DEVICE LETTERS, 2018 3. Improved Sensitivity of Inkjet-Printed PEDOT:PSS Ammonia Sensor With “Nonideal” MorphologyAuthors: Siying Li; Yuanzhe Li; Sujie Chen; Wei Tang; Yukun Huang; Sai Peng; Jianrong Qi; Xiaojun Guo.Journal: IEEE SENSORS LETTERS, 2018 2. Silver nanowire/polymer composite soft conductive film fabricated by large-area compatible coating for flexible pressure sensor arrayAuthors: Sujie Chen, Siying Li, Sai Peng, Yukun Huang, Jiaqing Zhao, Wei Tang and Xiaojun GuoJournal: JOURNAL OF SEMICONDUCTORS, 2018 1. Stable Thin-Film Reference Electrode on Plastic Substrate for All-Solid-State Ion-Sensitive Field-Effect Transistor Sensing SystemAuthors: Qiaofeng Li; Wei Tang; Yuezeng Su; Yukun Huang; Sai Peng; Bengang Zhuo; Shi Qiu; Li Ding; Yuanzhe Li; Xiaojun Guo.Journal: IEEE ELECTRON DEVICE LETTERS, 2017 Conferences 1. Wireless Readout System for Pressure Monitoring Using FFF-Printed Mold Fabricated Flexible Piezoresistive SensorsAuthors: Sai Peng; Arthur Camelbeke; Kevin Deschamps; Veerle Vandeginste; Hans HallezConference: 2024 IEEE SENSORS, 2024","link":"/publications/index.html"}]}